<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="5" name="tokens" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="i32" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="tokens">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="in_n_layer_self_k_cache" type="Parameter" version="opset1">
			<data shape="6,?,448,512" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="in_n_layer_self_k_cache">
					<dim>6</dim>
					<dim>-1</dim>
					<dim>448</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="in_n_layer_self_v_cache" type="Parameter" version="opset1">
			<data shape="6,?,448,512" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="in_n_layer_self_v_cache">
					<dim>6</dim>
					<dim>-1</dim>
					<dim>448</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="n_layer_cross_k" type="Parameter" version="opset1">
			<data shape="6,?,?,512" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="n_layer_cross_k">
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="n_layer_cross_v" type="Parameter" version="opset1">
			<data shape="6,?,?,512" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="n_layer_cross_v">
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="offset" type="Parameter" version="opset1">
			<data shape="1" element_type="i64" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="i32" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="offset">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/Constant_174" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1, 1, 1" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_174_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/Constant_177" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1, 1, 1" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_177_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/Constant_162" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_162_output_0" />
			</output>
		</layer>
		<layer id="9" name="/Shape_52" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>6</dim>
					<dim>-1</dim>
					<dim>448</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/Shape_52_output_0,/Shape_53_output_0,/Shape_54_output_0,/Shape_60_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/Constant_161" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_161_output_0" />
			</output>
		</layer>
		<layer id="11" name="Constant_1027" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="12" name="/Gather_42" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Cast_20_output_0,/Gather_42_output_0" />
			</output>
		</layer>
		<layer id="13" name="/Constant_163" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_163_output_0" />
			</output>
		</layer>
		<layer id="14" name="/Range_9" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Range_9_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/Constant_175" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="16" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_175_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/Reshape_17" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Reshape_17_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/Add_17" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Add_17_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/Constant_165" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_165_output_0" />
			</output>
		</layer>
		<layer id="19" name="/Constant_164" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="40" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_164_output_0" />
			</output>
		</layer>
		<layer id="20" name="Constant_1041" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="21" name="/Gather_43" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Cast_21_output_0,/Gather_43_output_0" />
			</output>
		</layer>
		<layer id="22" name="/Constant_166" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_166_output_0" />
			</output>
		</layer>
		<layer id="23" name="/Range_10" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Range_10_output_0">
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/Constant_167" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_167_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_14977" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_140" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="27" name="/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Gather_117_output_0,/Gather_123_output_0,/Gather_129_output_0,/Gather_132_output_0,/Gather_159_output_0,/Gather_165_output_0,/Gather_171_output_0,/Gather_174_output_0,/Gather_1_output_0,/Gather_201_output_0,/Gather_207_output_0,/Gather_213_output_0,/Gather_216_output_0,/Gather_243_output_0,/Gather_249_output_0,/Gather_33_output_0,/Gather_39_output_0,/Gather_3_output_0,/Gather_45_output_0,/Gather_48_output_0,/Gather_6_output_0,/Gather_75_output_0,/Gather_81_output_0,/Gather_87_output_0,/Gather_90_output_0,/Gather_output_0,/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/Shape_110_output_0,/Shape_121_output_0,/Shape_122_output_0,/Shape_159_output_0,/Shape_170_output_0,/Shape_181_output_0,/Shape_182_output_0,/Shape_1_output_0,/Shape_219_output_0,/Shape_230_output_0,/Shape_241_output_0,/Shape_242_output_0,/Shape_279_output_0,/Shape_290_output_0,/Shape_2_output_0,/Shape_301_output_0,/Shape_302_output_0,/Shape_339_output_0,/Shape_350_output_0,/Shape_39_output_0,/Shape_50_output_0,/Shape_61_output_0,/Shape_62_output_0,/Shape_99_output_0,/Shape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_14980" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_147" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="31" name="/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Gather_118_output_0,/Gather_124_output_0,/Gather_130_output_0,/Gather_133_output_0,/Gather_160_output_0,/Gather_166_output_0,/Gather_172_output_0,/Gather_175_output_0,/Gather_202_output_0,/Gather_208_output_0,/Gather_214_output_0,/Gather_217_output_0,/Gather_244_output_0,/Gather_250_output_0,/Gather_2_output_0,/Gather_34_output_0,/Gather_40_output_0,/Gather_46_output_0,/Gather_49_output_0,/Gather_4_output_0,/Gather_76_output_0,/Gather_7_output_0,/Gather_82_output_0,/Gather_88_output_0,/Gather_91_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Add_102_output_0,/Add_106_output_0,/Add_12_output_0,/Add_16_output_0,/Add_20_output_0,/Add_21_output_0,/Add_2_output_0,/Add_30_output_0,/Add_34_output_0,/Add_38_output_0,/Add_39_output_0,/Add_3_output_0,/Add_48_output_0,/Add_52_output_0,/Add_56_output_0,/Add_57_output_0,/Add_66_output_0,/Add_70_output_0,/Add_74_output_0,/Add_75_output_0,/Add_84_output_0,/Add_88_output_0,/Add_92_output_0,/Add_93_output_0,/Add_output_0,/Unsqueeze_104_output_0,/Unsqueeze_105_output_0,/Unsqueeze_110_output_0,/Unsqueeze_111_output_0,/Unsqueeze_116_output_0,/Unsqueeze_117_output_0,/Unsqueeze_142_output_0,/Unsqueeze_143_output_0,/Unsqueeze_148_output_0,/Unsqueeze_149_output_0,/Unsqueeze_154_output_0,/Unsqueeze_155_output_0,/Unsqueeze_180_output_0,/Unsqueeze_181_output_0,/Unsqueeze_186_output_0,/Unsqueeze_187_output_0,/Unsqueeze_192_output_0,/Unsqueeze_193_output_0,/Unsqueeze_1_output_0,/Unsqueeze_218_output_0,/Unsqueeze_219_output_0,/Unsqueeze_224_output_0,/Unsqueeze_225_output_0,/Unsqueeze_28_output_0,/Unsqueeze_29_output_0,/Unsqueeze_2_output_0,/Unsqueeze_34_output_0,/Unsqueeze_35_output_0,/Unsqueeze_3_output_0,/Unsqueeze_40_output_0,/Unsqueeze_41_output_0,/Unsqueeze_66_output_0,/Unsqueeze_67_output_0,/Unsqueeze_72_output_0,/Unsqueeze_73_output_0,/Unsqueeze_78_output_0,/Unsqueeze_79_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/Constant_170" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_170_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/Slice_17" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>448</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/Slice_17_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/Constant_176" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="48" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_176_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/Reshape_18" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Reshape_18_output_0">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/Add_18" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Add_18_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/Constant_172" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_172_output_0" />
			</output>
		</layer>
		<layer id="39" name="/Constant_171" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_171_output_0" />
			</output>
		</layer>
		<layer id="40" name="Constant_1062" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="41" name="/Gather_44" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Cast_22_output_0,/Gather_44_output_0" />
			</output>
		</layer>
		<layer id="42" name="/Constant_173" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_173_output_0" />
			</output>
		</layer>
		<layer id="43" name="/Range_11" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Range_11_output_0">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/Add_19" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Add_19_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/Shape_55" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/Concat_15_output_0,/Shape_55_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/Mul_14" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="72" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Mul_14_output_0,/Mul_15_output_0,/Mul_16_output_0,/Mul_17_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/Equal_10" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/Equal_10_output_0,/Equal_11_output_0,/Equal_12_output_0,/Equal_13_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/ConstantOfShape_10" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="104" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/ConstantOfShape_10_output_0,/ConstantOfShape_11_output_0,/ConstantOfShape_12_output_0,/ConstantOfShape_13_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/Where_10" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/Where_10_output_0,/Where_11_output_0,/Where_12_output_0,/Where_13_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/Expand_14" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Expand_14_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/Constant_179" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="136" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_179_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/Unsqueeze_36" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Unsqueeze_36_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/Expand_15" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Expand_15_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/Constant_181" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="136" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_181_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/Unsqueeze_37" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Unsqueeze_37_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/Expand_16" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Expand_16_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/Constant_183" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="136" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_183_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/Unsqueeze_38" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Unsqueeze_38_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/Expand_17" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Expand_17_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/Constant_185" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="136" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_185_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/Unsqueeze_39" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Unsqueeze_39_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/Concat_14" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/Concat_14_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_output_0" />
			</output>
		</layer>
		<layer id="64" name="Constant_182" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="65" name="/Gather_8" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>6</dim>
					<dim>-1</dim>
					<dim>448</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/Gather_41_output_0,/Gather_8_output_0">
					<dim>-1</dim>
					<dim>448</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_16583" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="144" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_16584" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="144" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_16580" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_16579" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="160" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="ScatterUpdate_16585" type="ScatterUpdate" version="opset3">
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_16588" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="164" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/Slice_2" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0" end_mask="1, 0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>448</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="/Slice_16_output_0,/Slice_2_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/Constant_53" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_53_output_0" />
			</output>
		</layer>
		<layer id="74" name="/Shape_15" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/Shape_15_output_0,/Shape_16_output_0,/Shape_17_output_0,/Shape_22_output_0,/Shape_51_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/Constant_52" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_52_output_0" />
			</output>
		</layer>
		<layer id="76" name="Constant_399" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="77" name="/Gather_16" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Cast_4_output_0,/Gather_16_output_0" />
			</output>
		</layer>
		<layer id="78" name="/Constant_54" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_54_output_0" />
			</output>
		</layer>
		<layer id="79" name="/Range_3" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Range_3_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/Constant_65" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="16" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_65_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Reshape_3_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/Constant_56" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_56_output_0" />
			</output>
		</layer>
		<layer id="83" name="/Constant_55" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_55_output_0" />
			</output>
		</layer>
		<layer id="84" name="Constant_413" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="85" name="/Gather_17" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Cast_5_output_0,/Gather_17_output_0" />
			</output>
		</layer>
		<layer id="86" name="/Constant_57" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_57_output_0" />
			</output>
		</layer>
		<layer id="87" name="/Range_4" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Range_4_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_21406_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="180" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_21406" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="onnx::MatMul_4544_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="51865, 512" offset="1204" size="53109760" />
			<output>
				<port id="0" precision="FP16">
					<dim>51865</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="onnx::MatMul_4544" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>51865</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::MatMul_4544,textDecoder.token_embedding.weight">
					<dim>51865</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_137" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="93" name="/token_embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>51865</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/token_embedding/Gather_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="textDecoder.positional_embedding_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="448, 512" offset="53110964" size="458752" />
			<output>
				<port id="0" precision="FP16">
					<dim>448</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="textDecoder.positional_embedding" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>448</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="textDecoder.positional_embedding">
					<dim>448</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>448</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="/Slice_output_0">
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Add_1_output_0,/Cast_output_0,/attn_ln/Cast_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_195" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="136" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/attn_ln/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/attn_ln/Div_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_21404_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="53569716" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_21404" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/attn_ln/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/attn_ln/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_21405_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="53570740" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_21405" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/attn_ln/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/attn_ln/Add_1_output_0,/attn_ln/Cast_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Transpose_18236_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 512" offset="53571764" size="524288" />
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Transpose_18236" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/value/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/value/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="/value/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/value/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="/Shape_13" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/Shape_13_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="/Constant_47" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_47_output_0" />
			</output>
		</layer>
		<layer id="113" name="Constant_382" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="114" name="/Gather_15" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Gather_15_output_0" />
			</output>
		</layer>
		<layer id="115" name="Constant_18971" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="136" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="116" name="/Neg_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/Neg_1_output_0" />
			</output>
		</layer>
		<layer id="117" name="/Constant_48" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_48_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="/Unsqueeze_9" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Unsqueeze_10_output_0,/Unsqueeze_9_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="/Constant_59" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="54096052" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_59_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="/Constant_61" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_61_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="/Slice_7" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/Slice_7_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="/Constant_66" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="48" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_66_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Reshape_4_output_0">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="/Add_6" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Add_6_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="/Constant_63" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_63_output_0" />
			</output>
		</layer>
		<layer id="126" name="/Constant_62" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="40" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_62_output_0" />
			</output>
		</layer>
		<layer id="127" name="Constant_434" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="128" name="/Gather_18" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Cast_6_output_0,/Gather_18_output_0" />
			</output>
		</layer>
		<layer id="129" name="/Constant_64" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_64_output_0" />
			</output>
		</layer>
		<layer id="130" name="/Range_5" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Range_5_output_0">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="/Add_7" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Add_7_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
