<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="0" name="mel" type="Parameter" version="opset1">
			<data shape="?,80,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="mel">
					<dim>-1</dim>
					<dim>80</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_3841_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="0" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_3841" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="onnx::Conv_1218_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 80, 3" offset="1024" size="245760" />
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>80</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="onnx::Conv_1218" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>80</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_1218">
					<dim>512</dim>
					<dim>80</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/audioEncoder/conv1/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="1" pads_end="1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>80</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>80</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Reshape_129_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512, 1" offset="246784" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Reshape_129" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/audioEncoder/conv1/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/conv1/Conv_output_0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/audioEncoder/Mul_1" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/audioEncoder/Mul_1_output_0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="onnx::Conv_1220_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 512, 3" offset="247808" size="1572864" />
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="onnx::Conv_1220" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_1220">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/audioEncoder/conv2/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2" dilations="1" pads_begin="1" pads_end="1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Reshape_153_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512, 1" offset="1820672" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_153" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/audioEncoder/conv2/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/conv2/Conv_output_0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/audioEncoder/Mul_3" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/audioEncoder/Mul_3_output_0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_165" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1821696" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/audioEncoder/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/Transpose_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="audioEncoder.positional_embedding_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1500, 512" offset="1821720" size="1536000" />
			<output>
				<port id="0" precision="FP16">
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="audioEncoder.positional_embedding" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="audioEncoder.positional_embedding">
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/audioEncoder/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3357720" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/audioEncoder/Constant_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/audioEncoder/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/audioEncoder/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_2774" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3357728" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_169" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3357720" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="25" name="/audioEncoder/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/audioEncoder/Gather_output_0,/audioEncoder/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/audioEncoder/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3357728" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/audioEncoder/Constant_10_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/audioEncoder/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>1500</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="/audioEncoder/Slice_output_0">
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/audioEncoder/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/Add_2_output_0,/audioEncoder/Cast_output_0,/audioEncoder/blocks.0/attn_ln/Cast_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_3789_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="3357736" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_3789" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_3787_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="3358760" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_3787" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_181" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3359784" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/audioEncoder/blocks.0/attn_ln/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn_ln/Div_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_3785_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="3359792" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_3785" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/audioEncoder/blocks.0/attn_ln/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn_ln/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_3786_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="3360816" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_3786" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/audioEncoder/blocks.0/attn_ln/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn_ln/Add_1_output_0,/audioEncoder/blocks.0/attn_ln/Cast_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Transpose_3190_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 512" offset="3361840" size="524288" />
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Transpose_3190" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/audioEncoder/blocks.0/attn/query/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn/query/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/audioEncoder/blocks.0/attn/query/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn/query/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/audioEncoder/blocks.0/attn/Concat" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3886128" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/audioEncoder/blocks.0/attn/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn/Reshape_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_229" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3886160" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/audioEncoder/blocks.0/attn/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn/Transpose_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/audioEncoder/blocks.0/attn/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/audioEncoder/blocks.0/attn/Shape_1_output_0,/audioEncoder/blocks.0/attn/Shape_2_output_0,/audioEncoder/blocks.0/attn/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/audioEncoder/blocks.0/attn/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3886192" size="8" />
			<output>
				<port id="0" precision="I64" names="/audioEncoder/blocks.0/attn/Constant_output_0" />
			</output>
		</layer>
		<layer id="51" name="Constant_202" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3357720" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="52" name="/audioEncoder/blocks.0/attn/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/audioEncoder/blocks.0/attn/Gather_output_0" />
			</output>
		</layer>
		<layer id="53" name="/audioEncoder/blocks.0/attn/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3886200" size="8" />
			<output>
				<port id="0" precision="I64" names="/audioEncoder/blocks.0/attn/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="54" name="/audioEncoder/blocks.0/attn/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/audioEncoder/blocks.0/attn/Cast_1_output_0,/audioEncoder/blocks.0/attn/Cast_output_0,/audioEncoder/blocks.0/attn/Div_output_0" />
			</output>
		</layer>
		<layer id="55" name="/audioEncoder/blocks.0/attn/Cast_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="FP32" names="/audioEncoder/blocks.0/attn/Cast_2_output_0" />
			</output>
		</layer>
		<layer id="56" name="/audioEncoder/blocks.0/attn/Constant_2_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="3886208" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="57" name="/audioEncoder/blocks.0/attn/Constant_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" names="/audioEncoder/blocks.0/attn/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="58" name="/audioEncoder/blocks.0/attn/Pow" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn/Pow_output_0" />
			</output>
		</layer>
		<layer id="59" name="/audioEncoder/blocks.0/attn/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn/Mul_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Transpose_3199_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 512" offset="3886210" size="524288" />
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Transpose_3199" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/audioEncoder/blocks.0/attn/key/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn/key/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/audioEncoder/blocks.0/attn/Concat_1" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3886128" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/audioEncoder/blocks.0/attn/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn/Reshape_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_250" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4410498" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/audioEncoder/blocks.0/attn/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn/Transpose_1_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/audioEncoder/blocks.0/attn/Mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn/Mul_1_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/audioEncoder/blocks.0/attn/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn/Cast_3_output_0,/audioEncoder/blocks.0/attn/MatMul_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/audioEncoder/blocks.0/attn/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/audioEncoder/blocks.0/attn/Cast_4_output_0,/audioEncoder/blocks.0/attn/Softmax_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_3788_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="4410530" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_3788" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Transpose_3204_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 512" offset="4411554" size="524288" />
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Transpose_3204" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/audioEncoder/blocks.0/attn/value/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn/value/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/audioEncoder/blocks.0/attn/value/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn/value/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/audioEncoder/blocks.0/attn/Concat_2" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3886128" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/audioEncoder/blocks.0/attn/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn/Reshape_2_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_271" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3886160" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/audioEncoder/blocks.0/attn/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn/Transpose_2_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/audioEncoder/blocks.0/attn/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn/MatMul_1_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_278" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3886160" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/audioEncoder/blocks.0/attn/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn/Transpose_3_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/audioEncoder/blocks.0/attn/Shape_7" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/audioEncoder/blocks.0/attn/Shape_7_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/audioEncoder/blocks.0/attn/Constant_16" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3357720" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/audioEncoder/blocks.0/attn/Constant_16_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/audioEncoder/blocks.0/attn/Constant_17" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3886192" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/audioEncoder/blocks.0/attn/Constant_17_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Broadcast_286" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3357728" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/audioEncoder/blocks.0/attn/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/audioEncoder/blocks.0/attn/Slice_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/audioEncoder/blocks.0/attn/Constant_18" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3359784" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/audioEncoder/blocks.0/attn/Constant_18_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/audioEncoder/blocks.0/attn/Concat_3" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/audioEncoder/blocks.0/attn/Concat_3_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/audioEncoder/blocks.0/attn/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn/Reshape_3_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Transpose_3211_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 512" offset="4935842" size="524288" />
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Transpose_3211" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/audioEncoder/blocks.0/attn/out/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn/out/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/audioEncoder/blocks.0/attn/out/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/attn/out/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/audioEncoder/blocks.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/Add_output_0,/audioEncoder/blocks.0/mlp_ln/Cast_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_3793_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="5460130" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_3793" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_3792_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 2048" offset="5461154" size="4096" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_3792" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_302" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3359784" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="/audioEncoder/blocks.0/mlp_ln/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/mlp_ln/Div_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_3790_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="5465250" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_3790" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/audioEncoder/blocks.0/mlp_ln/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/mlp_ln/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_3791_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="5466274" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_3791" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/audioEncoder/blocks.0/mlp_ln/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/mlp_ln/Add_1_output_0,/audioEncoder/blocks.0/mlp_ln/Cast_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Transpose_3229_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2048, 512" offset="5467298" size="2097152" />
			<output>
				<port id="0" precision="FP16">
					<dim>2048</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Transpose_3229" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2048</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2048</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="/audioEncoder/blocks.0/mlp/mlp.0/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2048</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/mlp/mlp.0/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="/audioEncoder/blocks.0/mlp/mlp.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/mlp/mlp.0/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="/audioEncoder/blocks.0/mlp/mlp.1/Mul_1" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/audioEncoder/blocks.0/mlp/mlp.1/Mul_1_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Transpose_3241_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 2048" offset="7564450" size="2097152" />
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Transpose_3241" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="/audioEncoder/blocks.0/mlp/mlp.2/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/mlp/mlp.2/MatMul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="/audioEncoder/blocks.0/mlp/mlp.2/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/mlp/mlp.2/Add_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="/audioEncoder/blocks.0/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/audioEncoder/blocks.0/Add_1_output_0,/audioEncoder/blocks.1/attn_ln/Cast_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Constant_3798_compressed" type="Const" version="opset1">
